Revit 2015 API
WorksetConfiguration.CloseAll Method
 Sets the configuration to close user-created worksets by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015.  Use the constructor to specify the default rule for workset opening instead.")]
public void CloseAll()
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015.  Use the constructor to specify the default rule for workset opening instead.")> _
Public Sub CloseAll
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015.  Use the constructor to specify the default rule for workset opening instead.")]
public:
void CloseAll()
Remarks
 Calling this method on a configuration created with WorksetConfigurationOption.OpenAllWorksets will change the configuration to close all worksets. Otherwise, this has no effect.
See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace